let allData = {
    "95": [["香蕉", ["日本", "中國", "香港"]], ["荔枝", ["日本", "加拿大", "美國", "比利時"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國"]], ["釋迦", ["中國", "香港", "新加坡", "加拿大"]], ["葡萄", ["新加坡", "香港", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "紐西蘭", "加拿大"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "新加坡"]]],
    "96": [["香蕉", ["日本", "中國", "香港", "韓國", "卡達"]], ["荔枝", ["日本", "新加坡", "加拿大", "美國", "西班牙"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "澳門"]], ["釋迦", ["中國", "香港", "新加坡", "加拿大", "馬來西亞"]], ["葡萄", ["新加坡", "香港", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "澳洲", "澳門", "印尼", "加拿大"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "新加坡", "加拿大", "韓國", "美國", "紐西蘭", "馬來西亞"]]],
    "97": [["香蕉", ["日本"]], ["荔枝", ["日本", "菲律賓", "加拿大", "美國", "智利"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "澳門"]], ["釋迦", ["中國", "香港", "新加坡", "加拿大", "印尼", "馬來西亞", "美國"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "澳門", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "印尼", "澳洲", "俄羅斯", "加拿大", "泰國", "阿拉伯"]], ["蓮霧", ["中國", "香港", "加拿大"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "新加坡", "加拿大", "韓國", "澳門", "馬來西亞"]]],
    "98": [["香蕉", ["日本", "中國"]], ["荔枝", ["日本", "香港", "加拿大", "美國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "澳門"]], ["釋迦", ["中國", "香港", "新加坡", "加拿大", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "越南", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "澳洲", "印尼", "美國", "加拿大", "泰國"]], ["蓮霧", ["中國", "香港", "加拿大"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門", "馬來西亞"]], ["葡萄柚", ["香港", "中國", "新加坡", "加拿大", "韓國", "紐西蘭", "馬來西亞", "美國"]]],
    "99": [["香蕉", ["日本", "中國", "加拿大"]], ["荔枝", ["日本", "新加坡", "加拿大", "美國", "菲律賓"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "印尼", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "澳洲", "印尼", "俄羅斯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "印尼"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門", "菲律賓"]], ["葡萄柚", ["香港", "中國", "新加坡", "澳洲", "韓國", "紐西蘭", "馬來西亞", "美國", "泰國"]]],
    "100": [["香蕉", ["日本", "中國", "加拿大", "香港"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "加拿大", "美國", "菲律賓", "中國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡"]], ["釋迦", ["中國", "香港", "加拿大", "新加坡", "馬來西亞", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "印尼", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "澳門", "汶萊", "印尼", "俄羅斯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "澳門"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本"]], ["葡萄柚", ["香港", "中國", "新加坡", "澳洲", "韓國", "加拿大", "馬來西亞", "美國", "智利"]]],
    "101": [["香蕉", ["日本", "中國", "香港"]], ["荔枝", ["日本", "香港", "馬來西亞", "新加坡", "加拿大", "美國", "中國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "澳門"]], ["釋迦", ["中國", "香港", "加拿大", "新加坡", "馬來西亞", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "印尼", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "汶萊", "卡達"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "馬來西亞"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "新加坡", "澳洲", "韓國", "紐西蘭", "馬來西亞", "美國", "澳門", "德國"]]],
    "102": [["香蕉", ["日本", "中國", "香港", "新加坡"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "加拿大", "美國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "馬來西亞", "韓國", "帛琉", "汶萊"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "汶萊", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "汶萊"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門", "汶萊"]], ["葡萄柚", ["香港", "中國", "新加坡", "澳洲", "韓國", "加拿大", "馬來西亞", "美國", "泰國", "智利", "日本", "越南", "汶萊"]]],
    "103": [["香蕉", ["日本", "中國", "香港"]], ["荔枝", ["日本", "香港", "馬來西亞", "新加坡", "加拿大", "美國", "汶萊", "菲律賓", "印尼", "韓國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "馬來西亞", "韓國"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "澳門"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "印尼", "汶萊", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "馬來西亞", "汶萊", "俄羅斯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本"]], ["葡萄柚", ["香港", "中國", "新加坡", "韓國", "馬來西亞", "美國", "德國", "日本"]]],
    "104": [["香蕉", ["日本", "中國", "香港", "新加坡"]], ["荔枝", ["日本", "香港", "馬來西亞", "新加坡", "加拿大", "美國", "韓國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "關島", "阿拉伯"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "巴林"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "阿拉伯", "印尼", "汶萊"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "馬來西亞", "澳門", "汶萊", "泰國", "阿拉伯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "澳洲", "韓國", "馬來西亞", "美國", "德國", "加拿大", "越南", "菲律賓"]]],
    "105": [["香蕉", ["日本", "新加坡"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "美國", "韓國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "關島"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "巴林", "澳門"]], ["葡萄", ["新加坡", "香港", "中國", "阿拉伯"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡"]], ["蓮霧", ["中國", "香港", "加拿大", "印尼"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "德國", "加拿大", "日本", "菲律賓"]]],
    "106": [["香蕉", ["日本", "中國", "阿拉伯"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "香港", "汶萊"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "越南"]], ["葡萄", ["新加坡", "香港", "中國", "馬來西亞"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "馬來西亞", "澳門", "俄羅斯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "澳門", "日本"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "紐西蘭", "加拿大", "日本", "菲律賓"]]],
    "107": [["香蕉", ["日本", "中國", "阿拉伯"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "香港", "加拿大", "澳門"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "泰國"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "越南", "澳門", "科威特"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "帛琉", "澳門"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "馬來西亞", "澳門"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "澳門"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "澳門", "日本"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "澳門", "加拿大", "日本", "菲律賓", "澳門", "德國"]]],
    "108": [["香蕉", ["日本", "中國", "帛琉"]], ["荔枝", ["日本", "香港", "加拿大"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "澳門", "馬來西亞", "泰國", "帛琉"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "澳門", "科威特"]], ["葡萄", ["新加坡", "香港", "中國", "馬來西亞", "帛琉"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "澳門", "帛琉", "泰國"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "帛琉", "澳門"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "帛琉", "澳門"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "澳門", "加拿大", "日本", "菲律賓", "紐西蘭"]]],
    "109": [["香蕉", ["日本", "中國", "阿拉伯"]], ["荔枝", ["日本", "香港", "馬來西亞", "新加坡", "加拿大", "澳門", "汶萊"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "澳門", "馬來西亞", "泰國", "泰國"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "澳門", "汶萊"]], ["葡萄", ["新加坡", "香港"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "澳門", "汶萊"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "澳門", "日本", "菲律賓", "馬來西亞"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "帛琉", "澳門"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "澳門", "加拿大", "日本", "德國", "新加坡"]]]
}

let year1 = "95";
let year2 = "109";

function dataHandler(year1, year2) {
    let dataSet = [];
    let positionTable = {};//紀錄水果在dataSet 的位置（因為無法用indexOf 取
    let fruitPostion = 0;

    for (const [year, aYearData] of Object.entries(allData)) {
        if (parseInt(year) >= parseInt(year1) && parseInt(year) <= parseInt(year2)) {
            aYearData.forEach(fruitCountry => {
                //某年的某水果和對應國家陣列
                let fruit = fruitCountry[0]
                let countrys = fruitCountry[1];
                //alert(countrys);

                //先加上水果
                //如果dataset 沒有這個水果就加上
                if (!checkFruit(fruit, dataSet)) {
                    dataSet.push([fruit, []]);
                    positionTable[fruit] = fruitPostion;
                    fruitPostion++;
                }

                //處理國家
                countrys.forEach(country => {
                    let position = positionTable[fruit];
                    if (dataSet[position][1].indexOf(country) === -1) {
                        dataSet[position][1].push(country);
                    }
                })


            })
        }
    }
    return dataSet

}

function checkFruit(fruit, data) {
    let fruitExist = false;
    data.forEach(d => {
        if (d.indexOf(fruit) > -1) {
            fruitExist = true;
            return;
        }
    })
    return fruitExist;
}
var nowyear1;
nowyear1 = dataHandler(year1, year2);

// 設定貿易資料
var data95 = [["香蕉", ["日本", "中國", "香港"]], ["荔枝", ["日本", "加拿大", "美國", "比利時"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國"]], ["釋迦", ["中國", "香港", "新加坡", "加拿大"]], ["葡萄", ["新加坡", "香港", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "紐西蘭", "加拿大"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "新加坡"]]];
var data96 = [["香蕉", ["日本", "中國", "香港", "韓國", "卡達"]], ["荔枝", ["日本", "新加坡", "加拿大", "美國", "西班牙"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "澳門"]], ["釋迦", ["中國", "香港", "新加坡", "加拿大", "馬來西亞"]], ["葡萄", ["新加坡", "香港", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "澳洲", "澳門", "印尼", "加拿大"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "新加坡", "加拿大", "韓國", "美國", "紐西蘭", "馬來西亞"]]];
var data97 = [["香蕉", ["日本"]], ["荔枝", ["日本", "菲律賓", "加拿大", "美國", "智利"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "澳門"]], ["釋迦", ["中國", "香港", "新加坡", "加拿大", "印尼", "馬來西亞", "美國"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "澳門", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "印尼", "澳洲", "俄羅斯", "加拿大", "泰國", "阿拉伯"]], ["蓮霧", ["中國", "香港", "加拿大"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "新加坡", "加拿大", "韓國", "澳門", "馬來西亞"]]];
var data98 = [["香蕉", ["日本", "中國"]], ["荔枝", ["日本", "香港", "加拿大", "美國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "澳門"]], ["釋迦", ["中國", "香港", "新加坡", "加拿大", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "越南", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "澳洲", "印尼", "美國", "加拿大", "泰國"]], ["蓮霧", ["中國", "香港", "加拿大"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門", "馬來西亞"]], ["葡萄柚", ["香港", "中國", "新加坡", "加拿大", "韓國", "紐西蘭", "馬來西亞", "美國"]]];
var data99 = [["香蕉", ["日本", "中國", "加拿大"]], ["荔枝", ["日本", "新加坡", "加拿大", "美國", "菲律賓"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "印尼", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "馬來西亞", "澳洲", "印尼", "俄羅斯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "印尼"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門", "菲律賓"]], ["葡萄柚", ["香港", "中國", "新加坡", "澳洲", "韓國", "紐西蘭", "馬來西亞", "美國", "泰國"]]];
var data100 = [["香蕉", ["日本", "中國", "加拿大", "香港"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "加拿大", "美國", "菲律賓", "中國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡"]], ["釋迦", ["中國", "香港", "加拿大", "新加坡", "馬來西亞", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "印尼", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "澳門", "汶萊", "印尼", "俄羅斯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "澳門"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本"]], ["葡萄柚", ["香港", "中國", "新加坡", "澳洲", "韓國", "加拿大", "馬來西亞", "美國", "智利"]]];
var data101 = [["香蕉", ["日本", "中國", "香港"]], ["荔枝", ["日本", "香港", "馬來西亞", "新加坡", "加拿大", "美國", "中國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "澳門"]], ["釋迦", ["中國", "香港", "加拿大", "新加坡", "馬來西亞", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "印尼", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "汶萊", "卡達"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "馬來西亞"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "新加坡", "澳洲", "韓國", "紐西蘭", "馬來西亞", "美國", "澳門", "德國"]]];
var data102 = [["香蕉", ["日本", "中國", "香港", "新加坡"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "加拿大", "美國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "馬來西亞", "韓國", "帛琉", "汶萊"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "汶萊", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "汶萊"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門", "汶萊"]], ["葡萄柚", ["香港", "中國", "新加坡", "澳洲", "韓國", "加拿大", "馬來西亞", "美國", "泰國", "智利", "日本", "越南", "汶萊"]]];
var data103 = [["香蕉", ["日本", "中國", "香港"]], ["荔枝", ["日本", "香港", "馬來西亞", "新加坡", "加拿大", "美國", "汶萊", "菲律賓", "印尼", "韓國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "馬來西亞", "韓國"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "澳門"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "印尼", "汶萊", "日本"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "馬來西亞", "汶萊", "俄羅斯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本"]], ["葡萄柚", ["香港", "中國", "新加坡", "韓國", "馬來西亞", "美國", "德國", "日本"]]];
var data104 = [["香蕉", ["日本", "中國", "香港", "新加坡"]], ["荔枝", ["日本", "香港", "馬來西亞", "新加坡", "加拿大", "美國", "韓國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "關島", "阿拉伯"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "巴林"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "阿拉伯", "印尼", "汶萊"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "馬來西亞", "澳門", "汶萊", "泰國", "阿拉伯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本", "澳門"]], ["葡萄柚", ["香港", "中國", "澳洲", "韓國", "馬來西亞", "美國", "德國", "加拿大", "越南", "菲律賓"]]];
var data105 = [["香蕉", ["日本", "新加坡"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "美國", "韓國"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "韓國", "關島"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "巴林", "澳門"]], ["葡萄", ["新加坡", "香港", "中國", "阿拉伯"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡"]], ["蓮霧", ["中國", "香港", "加拿大", "印尼"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "日本"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "德國", "加拿大", "日本", "菲律賓"]]];
var data106 = [["香蕉", ["日本", "中國", "阿拉伯"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "香港", "汶萊"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "越南"]], ["葡萄", ["新加坡", "香港", "中國", "馬來西亞"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "馬來西亞", "澳門", "俄羅斯"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "澳門", "日本"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "紐西蘭", "加拿大", "日本", "菲律賓"]]];
var data107 = [["香蕉", ["日本", "中國", "阿拉伯"]], ["荔枝", ["日本", "馬來西亞", "新加坡", "香港", "加拿大", "澳門"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "泰國"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "越南", "澳門", "科威特"]], ["葡萄", ["新加坡", "香港", "馬來西亞", "帛琉", "澳門"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "馬來西亞", "澳門"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "澳門"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "澳門", "日本"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "澳門", "加拿大", "日本", "菲律賓", "澳門", "德國"]]];
var data108 = [["香蕉", ["日本", "中國", "帛琉"]], ["荔枝", ["日本", "香港", "加拿大"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "澳門", "馬來西亞", "泰國", "帛琉"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "澳門", "科威特"]], ["葡萄", ["新加坡", "香港", "中國", "馬來西亞", "帛琉"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "澳門", "帛琉", "泰國"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "帛琉", "澳門"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "帛琉", "澳門"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "澳門", "加拿大", "日本", "菲律賓", "紐西蘭"]]];
var data109 = [["香蕉", ["日本", "中國", "阿拉伯"]], ["荔枝", ["日本", "香港", "馬來西亞", "新加坡", "加拿大", "澳門", "汶萊"]], ["鳳梨", ["中國", "日本", "香港", "新加坡", "加拿大", "澳門", "馬來西亞", "泰國", "泰國"]], ["釋迦", ["中國", "香港", "新加坡", "馬來西亞", "印尼", "加拿大", "澳門", "汶萊"]], ["葡萄", ["新加坡", "香港"]], ["芒果", ["中國", "香港", "韓國", "日本", "新加坡", "加拿大", "澳洲", "馬來西亞", "澳門", "汶萊"]], ["蓮霧", ["中國", "香港", "加拿大", "新加坡", "澳門", "日本", "菲律賓", "馬來西亞"]], ["柚子", ["中國", "香港", "加拿大", "新加坡", "帛琉", "澳門"]], ["葡萄柚", ["香港", "中國", "韓國", "馬來西亞", "美國", "澳門", "加拿大", "日本", "德國", "新加坡"]]];

var year = 95;

var nowyear;
function selectyear(year) {
    if (year == 95) {
        nowyear = data95;
    }
    else if (year == 96) {
        nowyear = data96;
    }
    else if (year == 97) {
        nowyear = data97;
    }
    else if (year == 98) {
        nowyear = data98;
    }
    else if (year == 99) {
        nowyear = data99;
    }
    else if (year == 100) {
        nowyear = data100;
    }
    else if (year == 101) {
        nowyear = data101;
    }
    else if (year == 102) {
        nowyear = data102;
    }
    else if (year == 103) {
        nowyear = data103;
    }
    else if (year == 104) {
        nowyear = data104;
    }
    else if (year == 105) {
        nowyear = data105;
    }
    else if (year == 106) {
        nowyear = data106;
    }
    else if (year == 107) {
        nowyear = data108;
    }
    else if (year == 109) {
        nowyear = data109;
    }
}

selectyear(year);

// 設定水果底色
var colors = ["#a50026", "#d73027", "#f46d43", "#fdae61", "#fee090", "#ffffbf", "#e0f3f8", "#abd9e9", "#74add1", "#4575b4"]
// 設定水果
var fruit = ["香蕉", "荔枝", "鳳梨", "釋迦", "葡萄", "芒果", "蓮霧", "柚子", "葡萄柚"];
// 設定圖形大小
var width3 = d3version4.select("#chart").node().getBoundingClientRect().width;
var height3 = d3version4.select("#chart").node().getBoundingClientRect().height;
// 矩形寬度
var rect_width = 70;
// 矩形高度
var rect_height = 30;
// 線條粗細
var link_width = "1px";
var svg = d3version3.select("#chart").append("svg")
    .attr("width", width3)
    .attr("height", height3)

function conceptchart(year1, year2) {
    var inner = [];
    var links = [];
    var outerId = [0];
    var outer = d3version3.map();
    d3version4.selectAll("#chart > svg > *").remove()
    nowyear1 = dataHandler(year1, year2);
    //console.log(nowyear1)

    nowyear1.forEach(function (d) {
        // d[0]是水果，d[1]是國家

        // 檢查資料是否為空
        if (d == null)
            return;

        // 製作json
        i = { id: 'i' + inner.length, name: d[0], related_links: [] };
        i.related_nodes = [i.id];
        inner.push(i);
        // 資料都上在此變數inner

        // 判斷d[1]是否為矩陣
        if (!Array.isArray(d[1]))
            d[1] = [d[1]];

        // 讀取d[1]資料
        d[1].forEach(function (d1) {

            o = outer.get(d1);

            if (o == null) {
                o = { name: d1, id: 'o' + outerId[0], related_links: [] };
                o.related_nodes = [o.id];
                outerId[0] = outerId[0] + 1;

                outer.set(d1, o);
            }

            // 建立連結
            l = { id: 'l-' + i.id + '-' + o.id, inner: i, outer: o }
            links.push(l);

            // 和關聯 o.id水果 l.id
            i.related_nodes.push(o.id);
            i.related_links.push(l.id);
            o.related_nodes.push(i.id);
            o.related_links.push(l.id);
        });
    });
    data = {
        inner: inner,
        outer: outer.values(),
        links: links
    }

    // 對數據進行排序
    outer = data.outer;
    data.outer = Array(outer.length);

    var i1 = 0;
    var i2 = outer.length - 1;

    for (var i = 0; i < data.outer.length; ++i) {
        if (i % 2 == 1)
            data.outer[i2--] = outer[i];
        else
            data.outer[i1++] = outer[i];
    }
    var il = data.inner.length;
    var ol = data.outer.length;
    // 比例尺
    var inner_y = d3version3.scale.linear()
        .domain([0, il])
        .range([-(il * rect_height) / 2, (il * rect_height) / 2]);

    mid = (data.outer.length / 2.0)
    var outer_x = d3version3.scale.linear()
        .domain([0, mid, mid, data.outer.length])
        .range([15, 170, 190, 355]);

    var outer_y = d3version3.scale.linear()
        .domain([0, data.outer.length])
        .range([0, height3 / 2 - 120]);

    // 會建立一個新的陣列，其內容為原陣列的每一個元素經由回呼函式運算後所回傳的結果之集
    data.outer = data.outer.map(function (d, i) {
        d.x = outer_x(i);
        d.y = height3 / 2.2;
        return d;
    });

    data.inner = data.inner.map(function (d, i) {
        d.x = -(rect_width / 2);
        d.y = inner_y(i);
        return d;
    });
    var diagonal = d3version3.svg.diagonal()
        .source(function (d) {
            return {
                "x": d.outer.y * Math.cos(projectX(d.outer.x)),
                "y": -d.outer.y * Math.sin(projectX(d.outer.x))
            };
        })
        .target(function (d) {
            return {
                "x": d.inner.y + rect_height / 2,
                "y": d.outer.x > 180 ? d.inner.x : d.inner.x + rect_width
            };
        })
        .projection(function (d) { return [d.y, d.x]; });

    svg.append("text")
        .text(`台灣出口國家關聯圖`)
        .attr("x", width3 - 190)
        .attr("y", 25)
        .attr("font-size", "20px")
    var g = svg.append("g")
        .attr("transform", "translate(" + width3 / 2 + ", " + height3 / 2 + ")");

    // 繪製水果與國家間線段
    var link = g.append("g").attr("class", "links").selectAll(".link")
        .data(data.links)
        .enter().append("path")
        .attr("class", "link")
        .attr("id", function (d) { return d.id })
        .attr("d", diagonal)
        .attr("stroke", function (d) { return get_color(d.inner.name); })
        .attr("stroke-width", link_width);

    // 繪製國家
    var onode = g.append("g").selectAll(".outer_node")
        .data(data.outer)
        .enter().append("g")
        .attr("class", "outer_node")
        .attr("transform", function (d) { return "rotate(" + (d.x - 90) + ")translate(" + d.y + ")"; })

    onode.append("circle")
        .attr("id", function (d) { return d.id })
        .attr("r", 4.5);

    onode.append("circle")
        .attr("r", 20)
        .attr("visibility", "hidden");

    onode.append("text")
        .attr("id", function (d) { return d.id + "-txt"; })
        .attr("dy", ".31em")
        .attr("text-anchor", function (d) { return d.x < 180 ? "start" : "end"; })
        .attr("transform", function (d) { return d.x < 180 ? "rotate(" + (180 - d.x - 90) + ")translate(8)" : "rotate(" + (180 - d.x - 90) + ")translate(-8)"; })
        .attr("fill", function (d) { return d.name == "巴林" | d.name == "汶萊" | d.name == "中國" | d.name == "香港" | d.name == "印尼" | d.name == "日本" | d.name == "卡達" | d.name == "韓國" | d.name == "科威特" | d.name == "澳門" | d.name == "馬來西亞" | d.name == "菲律賓" | d.name == "俄羅斯" | d.name == "新加坡" | d.name == "泰國" | d.name == "阿拉伯" | d.name == "越南" ? "rgb(78, 121, 167)" : d.name == "美國" | d.name == "加拿大" | d.name == "智利" | d.name == "關島" ? "rgb(225, 87, 89)" : d.name == "英國" | d.name == "德國" | d.name == "荷蘭" | d.name == "比利時" | d.name == "西班牙" ? "rgb(118, 183, 178)" : d.name == "澳洲" | d.name == "馬紹爾群島" | d.name == "紐西蘭" | d.name == "帛琉" ? "rgb(89, 161, 79)" : "black"; }) // ? d.name == "澳洲" | d.name == "馬紹爾群島" | d.name == "紐西蘭" | d.name == "帛琉"? "#808040" : "black"
        .text(function (d) { return d.name; });

    // 內部節點
    var inode = g.append("g").selectAll(".inner_node")
        .data(data.inner)
        .enter().append("g")
        .attr("class", "inner_node")
        .attr("transform", function (d, i) { return "translate(" + d.x + ", " + d.y + ")" })
        .on("click", mouseover)
    //.on("mouseout", mouseout);

    // 水果列表的矩形
    inode.append("rect")
        .attr("width", rect_width)
        .attr("height", rect_height)
        .attr("id", function (d) { return d.id; })
        //.attr("fill", function(d) { return get_color(d.name); });
        .attr("fill", function (d) { return "#f4f3ee"; })
        .attr("stroke", "gray")
        .attr("stroke-width", 0.5);

    // 水果列表的文字
    inode.append("text")
        .attr("id", function (d) { return d.id + "-txt"; })
        .attr("text-anchor", "middle")
        .attr("transform", "translate(" + rect_width / 2 + ", " + rect_height * .75 + ")")
        .text(function (d) { return d.name; });

    // 州例
    g.append("g")
        .append("rect")
        .attr("x", width3*0.4)
        .attr("y", height3*0.3)
        .attr("width", 12)
        .attr("height", 12)
        .style("fill", "rgb(78, 121, 167)");

    g.append("g")
        .append("text")
        .text("亞洲")
        .attr("x", width3*0.43)
        .attr("y", height3*0.32);

    g.append("g")
        .append("rect")
        .attr("x", width3*0.4)
        .attr("y", height3*0.34)
        .attr("width", 12)
        .attr("height", 12)
        .style("fill", "rgb(242, 142, 44)");

    g.append("g")
        .append("text")
        .text("非洲")
        .attr("x", width3*0.43)
        .attr("y", height3*0.363);


    g.append("g")
        .append("rect")
        .attr("x", width3*0.4)
        .attr("y", height3*0.38)
        .attr("width", 12)
        .attr("height", 12)
        .style("fill", "rgb(118, 183, 178)");

    g.append("g")
        .append("text")
        .text("歐洲")
        .attr("x", width3*0.43)
        .attr("y", height3*0.405);


    g.append("g")
        .append("rect")
        .attr("x", width3*0.4)
        .attr("y", height3*0.42)
        .attr("width", 12)
        .attr("height", 12)
        .style("fill", "rgb(225, 87, 89)");

    g.append("g")
        .append("text")
        .text("美洲")
        .attr("x", width3*0.43)
        .attr("y", height3*0.445);

    g.append("g")
        .append("rect")
        .attr("x", width3*0.4)
        .attr("y", height3*0.46)
        .attr("width", 12)
        .attr("height", 12)
        .style("fill", "rgb(89, 161, 79)");

    g.append("g")
        .append("text")
        .text("大洋洲")
        .attr("x", width3*0.43)
        .attr("y", height3*0.485);

}

// 決定水果底色
function get_color(name) {
    return colors[fruit.indexOf(name)];
}

// 計算角度
function projectX(x) {
    return ((x - 90) / 180 * Math.PI) - (Math.PI / 2);
}


// 顯示選擇水果
function display(d) {
    clear();
    d3version3.selectAll(".links .link").sort(function (a, b) { return d.related_links.indexOf(a.id); });

    for (var i = 0; i < d.related_nodes.length; i++) {
        d3version3.select("#" + d.related_nodes[i]).classed("highlight", true);
        d3version3.select("#" + d.related_nodes[i] + "-txt").attr("font-weight", "bold");
        d3version3.select("#" + d.related_links[i]).attr("stroke-width", "5px").style("opacity", "1");
    }

    Split = d.related_nodes[0].split("")
    // 這邊是呼叫另一張圖的函式喔！
    // 傳過去會是水果
    var fruit = nowyear[Split[1]][0];
    drawChart(fruit)
    document.getElementById("fruit").innerHTML = fruit;

}

function clear1(d) {
    for (var i = 0; i < d.related_nodes.length; i++) {
        d3version3.select("#" + d.related_nodes[i]).classed("highlight", false);
        d3version3.select("#" + d.related_nodes[i] + "-txt").attr("font-weight", "normal");
        d3version3.select("#" + d.related_links[i]).attr("stroke-width", link_width).style("opacity", "0.5");
    }
}

function clear() {
    for (var i = 0; i < 30; i++) {
        d3version3.select("#i" + String(i)).classed("highlight", false);
        d3version3.select("#i" + String(i) + "-txt").attr("font-weight", "normal");
        d3version3.select("#o" + String(i)).classed("highlight", false);
        d3version3.select("#o" + String(i) + "-txt").attr("font-weight", "normal");
        for (var j = 0; j < 30; j++) {
            d3version3.select("#l-i" + String(i) + "-o" + String(j)).attr("stroke-width", link_width).style("opacity", "0.5");
        }
    }
}

// 滑鼠經過觸發
function mouseover(d) {
    if (d.related_nodes[0] != null) {
        display(d);
    }
}

// 滑鼠離開觸發
function mouseout(d) {
    if (d.related_nodes[0] != null) {

    }
}